# Essential Functionality

### Reindexing
- __An important method on pandas objects is reindex , which means to create a new object with the data conformed to a new index__

In [3]:
# Example
import pandas as pd
import numpy as np

obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

- __'reindex' on this Series rearranges the data according to the new index, if any index values were not already present then it introduce 'NaN'__

In [7]:
obj_2 = obj.reindex(['a','b','c','d','e'])
obj_2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

- __'ffill' methods forward-fills the values__
- __Example__

In [8]:
obj_3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [9]:
obj_4 = obj_3.reindex(range(6), method = 'ffill')
obj_4

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

- __'reindex' can alter either the (row) index, columns, or both__

In [17]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),
                  index = ['a','d','c'],
                  columns = ['Newyork', 'California', 'LA']
                 )
frame

   Newyork  California  LA
a        0           1   2
d        3           4   5
c        6           7   8

In [18]:
# Now let's reindex this too

frame.reindex(['a','b','c','d'])

   Newyork  California   LA
a      0.0         1.0  2.0
b      NaN         NaN  NaN
c      6.0         7.0  8.0
d      3.0         4.0  5.0

- __We can also reindex columns too, by using 'columns' keyword__

In [19]:
states = ['Newyork', 'California','Texas','LA']

frame.reindex(columns = states)

   Newyork  California  Texas  LA
a        0           1    NaN   2
d        3           4    NaN   5
c        6           7    NaN   8



### Dropping Entries from an Axis
- __drop method will return a new object with the indicated value or values deleted from
an axis__

In [21]:
# Example

a_series = pd.Series(np.arange(6),['a','b','c','d','e','f'])
a_series

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int64

In [23]:
a_series.drop('c')

a    0
b    1
d    3
e    4
f    5
dtype: int64

In [24]:
a_series.drop(['b','e'])

a    0
c    2
d    3
f    5
dtype: int64

- __With DataFrame, index values can be deleted from either axis__

In [25]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four']
                   )
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [27]:
data.drop(['Ohio', 'Utah'])

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

- __You can drop values from the columns by passing axis=1 or axis='columns'__

In [28]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [31]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14